# Дано**:** пользователь делает вклад в размере Х рублей сроком на Y лет под 10% годовых (каждый год размер его вклада увеличивается на 10%, 
# эти деньги прибавляются к сумме вклада, и на них в следующем году тоже будут проценты).
# Задача: написать функцию bank, принимающую аргументы X и Y и возвращающую сумму, которая будет на счету пользователя спустя Y лет


x = int(input())
y = int(input())
m = int(input())

def bank(x, m, y):
        nal = x
        year = y
        def money():
            if year > 0:
                nal = x * 1.1 + m
                year = year -1
                return money()
            else:
                return nal

print (m)