# Задание 3: Напишите функцию square, принимающую 1 аргумент — сторону квадрата — и возвращающую площадь квадрата.

def square(a):

	s = a * a
	return s
	
print(square(5))